Microchip-MPLAB-Harmony/wireless_apps_pic32cxbz2_wbz45/apps/ieee_802_15_4/MAC/push_pull_mac_app/demoapp_ffd/firmware/src/packs/PIC32CX1012BZ25048_DFP/component/cfg.h
#define CFG_CFGPGQOSSET_Msk                   _UINT32_(0x00000000)                                 /* (CFG_CFGPGQOSSET) Register Mask  */


/* -------- CFG_CFGPGQOSINV : (CFG Offset: 0x5C) (R/W 32) Bit invert register -------- */
#define CFG_CFGPGQOSINV_RESETVALUE            _UINT32_(0x00)                                       /*  (CFG_CFGPGQOSINV) Bit invert register  Reset Value */

#define CFG_CFGPGQOSINV_Msk                   _UINT32_(0x00000000)                                 /* (CFG_CFGPGQOSINV) Register Mask  */


/* -------- CFG_CFGPCLKGEN1 : (CFG Offset: 0x60) (R/W 32)  -------- */
#define CFG_CFGPCLKGEN1_RESETVALUE            _UINT32_(0x00)                                       /*  (CFG_CFGPCLKGEN1)   Reset Value */

#define CFG_CFGPCLKGEN1_EICCSEL_Pos           _UINT32_(0)                                          /* (CFG_CFGPCLKGEN1) EIC Clock Selection Position */
#define CFG_CFGPCLKGEN1_EICCSEL_Msk           (_UINT32_(0x7) << CFG_CFGPCLKGEN1_EICCSEL_Pos)       /* (CFG_CFGPCLKGEN1) EIC Clock Selection Mask */
#define CFG_CFGPCLKGEN1_EICCSEL(value)        (CFG_CFGPCLKGEN1_EICCSEL_Msk & (_UINT32_(value) << CFG_CFGPCLKGEN1_EICCSEL_Pos)) /* Assigment of value for EICCSEL in the CFG_CFGPCLKGEN1 register */
#define   CFG_CFGPCLKGEN1_EICCSEL_NO_CLK_Val  _UINT32_(0x0)                                        /* (CFG_CFGPCLKGEN1) No Clock  */
#define   CFG_CFGPCLKGEN1_EICCSEL_REFO1_Val   _UINT32_(0x1)                                        /* (CFG_CFGPCLKGEN1) Reference Clock 1  */
#define   CFG_CFGPCLKGEN1_EICCSEL_REFO2_Val   _UINT32_(0x2)                                        /* (CFG_CFGPCLKGEN1) Reference Clock 2  */
#define   CFG_CFGPCLKGEN1_EICCSEL_REFO3_Val   _UINT32_(0x3)                                        /* (CFG_CFGPCLKGEN1) Reference Clock 3  */
#define   CFG_CFGPCLKGEN1_EICCSEL_REFO4_Val   _UINT32_(0x4)                                        /* (CFG_CFGPCLKGEN1) Reference Clock 4  */
#define   CFG_CFGPCLKGEN1_EICCSEL_REFO5_Val   _UINT32_(0x5)                                        /* (CFG_CFGPCLKGEN1) Reference Clock 5  */
#define   CFG_CFGPCLKGEN1_EICCSEL_REFO6_Val   _UINT32_(0x6)                                        /* (CFG_CFGPCLKGEN1) Reference Clock 6  */
#define   CFG_CFGPCLKGEN1_EICCSEL_LPCLK_Val   _UINT32_(0x7)                                        /* (CFG_CFGPCLKGEN1) 32 KHz Low Power Clock  */
#define CFG_CFGPCLKGEN1_EICCSEL_NO_CLK        (CFG_CFGPCLKGEN1_EICCSEL_NO_CLK_Val << CFG_CFGPCLKGEN1_EICCSEL_Pos) /* (CFG_CFGPCLKGEN1) No Clock Position  */
#define CFG_CFGPCLKGEN1_EICCSEL_REFO1         (CFG_CFGPCLKGEN1_EICCSEL_REFO1_Val << CFG_CFGPCLKGEN1_EICCSEL_Pos) /* (CFG_CFGPCLKGEN1) Reference Clock 1 Position  */
#define CFG_CFGPCLKGEN1_EICCSEL_REFO2         (CFG_CFGPCLKGEN1_EICCSEL_REFO2_Val << CFG_CFGPCLKGEN1_EICCSEL_Pos) /* (CFG_CFGPCLKGEN1) Reference Clock 2 Position  */
#define CFG_CFGPCLKGEN1_EICCSEL_REFO3         (CFG_CFGPCLKGEN1_EICCSEL_REFO3_Val << CFG_CFGPCLKGEN1_EICCSEL_Pos) /* (CFG_CFGPCLKGEN1) Reference Clock 3 Position  */
#define CFG_CFGPCLKGEN1_EICCSEL_REFO4         (CFG_CFGPCLKGEN1_EICCSEL_REFO4_Val << CFG_CFGPCLKGEN1_EICCSEL_Pos) /* (CFG_CFGPCLKGEN1) Reference Clock 4 Position  */
#define CFG_CFGPCLKGEN1_EICCSEL_REFO5         (CFG_CFGPCLKGEN1_EICCSEL_REFO5_Val << CFG_CFGPCLKGEN1_EICCSEL_Pos) /* (CFG_CFGPCLKGEN1) Reference Clock 5 Position  */
#define CFG_CFGPCLKGEN1_EICCSEL_REFO6         (CFG_CFGPCLKGEN1_EICCSEL_REFO6_Val << CFG_CFGPCLKGEN1_EICCSEL_Pos) /* (CFG_CFGPCLKGEN1) Reference Clock 6 Position  */
#define CFG_CFGPCLKGEN1_EICCSEL_LPCLK         (CFG_CFGPCLKGEN1_EICCSEL_LPCLK_Val << CFG_CFGPCLKGEN1_EICCSEL_Pos) /* (CFG_CFGPCLKGEN1) 32 KHz Low Power Clock Position  */
#define CFG_CFGPCLKGEN1_EICCD_Pos             _UINT32_(3)                                          /* (CFG_CFGPCLKGEN1) EIC Clock Disable Position */
#define CFG_CFGPCLKGEN1_EICCD_Msk             (_UINT32_(0x1) << CFG_CFGPCLKGEN1_EICCD_Pos)         /* (CFG_CFGPCLKGEN1) EIC Clock Disable Mask */
#define CFG_CFGPCLKGEN1_EICCD(value)          (CFG_CFGPCLKGEN1_EICCD_Msk & (_UINT32_(value) << CFG_CFGPCLKGEN1_EICCD_Pos)) /* Assigment of value for EICCD in the CFG_CFGPCLKGEN1 register */
#define   CFG_CFGPCLKGEN1_EICCD_ON_Val        _UINT32_(0x1)                                        /* (CFG_CFGPCLKGEN1) Enable PGCLK  */
#define   CFG_CFGPCLKGEN1_EICCD_OFF_Val       _UINT32_(0x0)                                        /* (CFG_CFGPCLKGEN1) Disable PGCLK  */
#define CFG_CFGPCLKGEN1_EICCD_ON              (CFG_CFGPCLKGEN1_EICCD_ON_Val << CFG_CFGPCLKGEN1_EICCD_Pos) /* (CFG_CFGPCLKGEN1) Enable PGCLK Position  */
#define CFG_CFGPCLKGEN1_EICCD_OFF             (CFG_CFGPCLKGEN1_EICCD_OFF_Val << CFG_CFGPCLKGEN1_EICCD_Pos) /* (CFG_CFGPCLKGEN1) Disable PGCLK Position  */
#define CFG_CFGPCLKGEN1_FREQMRCSEL_Pos        _UINT32_(4)                                          /* (CFG_CFGPCLKGEN1) FREQMRC Clock Selection Position */
#define CFG_CFGPCLKGEN1_FREQMRCSEL_Msk        (_UINT32_(0x7) << CFG_CFGPCLKGEN1_FREQMRCSEL_Pos)    /* (CFG_CFGPCLKGEN1) FREQMRC Clock Selection Mask */
#define CFG_CFGPCLKGEN1_FREQMRCSEL(value)     (CFG_CFGPCLKGEN1_FREQMRCSEL_Msk & (_UINT32_(value) << CFG_CFGPCLKGEN1_FREQMRCSEL_Pos)) /* Assigment of value for FREQMRCSEL in the CFG_CFGPCLKGEN1 register */
#define   CFG_CFGPCLKGEN1_FREQMRCSEL_NO_CLK_Val _UINT32_(0x0)                                        /* (CFG_CFGPCLKGEN1) No Clock  */
#define   CFG_CFGPCLKGEN1_FREQMRCSEL_REFO1_Val _UINT32_(0x1)                                        /* (CFG_CFGPCLKGEN1) Reference Clock 1  */
#define   CFG_CFGPCLKGEN1_FREQMRCSEL_REFO2_Val _UINT32_(0x2)                                        /* (CFG_CFGPCLKGEN1) Reference Clock 2  */
#define   CFG_CFGPCLKGEN1_FREQMRCSEL_REFO3_Val _UINT32_(0x3)                                        /* (CFG_CFGPCLKGEN1) Reference Clock 3  */
#define   CFG_CFGPCLKGEN1_FREQMRCSEL_REFO4_Val _UINT32_(0x4)                                        /* (CFG_CFGPCLKGEN1) Reference Clock 4  */
#define   CFG_CFGPCLKGEN1_FREQMRCSEL_REFO5_Val _UINT32_(0x5)                                        /* (CFG_CFGPCLKGEN1) Reference Clock 5  */
#define   CFG_CFGPCLKGEN1_FREQMRCSEL_REFO6_Val _UINT32_(0x6)                                        /* (CFG_CFGPCLKGEN1) Reference Clock 6  */
#define   CFG_CFGPCLKGEN1_FREQMRCSEL_LPCLK_Val _UINT32_(0x7)                                        /* (CFG_CFGPCLKGEN1) 32 KHz Low Power Clock  */
#define CFG_CFGPCLKGEN1_FREQMRCSEL_NO_CLK     (CFG_CFGPCLKGEN1_FREQMRCSEL_NO_CLK_Val << CFG_CFGPCLKGEN1_FREQMRCSEL_Pos) /* (CFG_CFGPCLKGEN1) No Clock Position  */
#define CFG_CFGPCLKGEN1_FREQMRCSEL_REFO1      (CFG_CFGPCLKGEN1_FREQMRCSEL_REFO1_Val << CFG_CFGPCLKGEN1_FREQMRCSEL_Pos) /* (CFG_CFGPCLKGEN1) Reference Clock 1 Position  */
#define CFG_CFGPCLKGEN1_FREQMRCSEL_REFO2      (CFG_CFGPCLKGEN1_FREQMRCSEL_REFO2_Val << CFG_CFGPCLKGEN1_FREQMRCSEL_Pos) /* (CFG_CFGPCLKGEN1) Reference Clock 2 Position  */
#define CFG_CFGPCLKGEN1_FREQMRCSEL_REFO3      (CFG_CFGPCLKGEN1_FREQMRCSEL_REFO3_Val << CFG_CFGPCLKGEN1_FREQMRCSEL_Pos) /* (CFG_CFGPCLKGEN1) Reference Clock 3 Position  */
#define CFG_CFGPCLKGEN1_FREQMRCSEL_REFO4      (CFG_CFGPCLKGEN1_FREQMRCSEL_REFO4_Val << CFG_CFGPCLKGEN1_FREQMRCSEL_Pos) /* (CFG_CFGPCLKGEN1) Reference Clock 4 Position  */
#define CFG_CFGPCLKGEN1_FREQMRCSEL_REFO5      (CFG_CFGPCLKGEN1_FREQMRCSEL_REFO5_Val << CFG_CFGPCLKGEN1_FREQMRCSEL_Pos) /* (CFG_CFGPCLKGEN1) Reference Clock 5 Position  */
#define CFG_CFGPCLKGEN1_FREQMRCSEL_REFO6      (CFG_CFGPCLKGEN1_FREQMRCSEL_REFO6_Val << CFG_CFGPCLKGEN1_FREQMRCSEL_Pos) /* (CFG_CFGPCLKGEN1) Reference Clock 6 Position  */
#define CFG_CFGPCLKGEN1_FREQMRCSEL_LPCLK      (CFG_CFGPCLKGEN1_FREQMRCSEL_LPCLK_Val << CFG_CFGPCLKGEN1_FREQMRCSEL_Pos) /* (CFG_CFGPCLKGEN1) 32 KHz Low Power Clock Position  */
#define CFG_CFGPCLKGEN1_RCD_Pos               _UINT32_(7)                                          /* (CFG_CFGPCLKGEN1) FREQMRC Clock Disable Position */
#define CFG_CFGPCLKGEN1_RCD_Msk               (_UINT32_(0x1) << CFG_CFGPCLKGEN1_RCD_Pos)           /* (CFG_CFGPCLKGEN1) FREQMRC Clock Disable Mask */
#define CFG_CFGPCLKGEN1_RCD(value)            (CFG_CFGPCLKGEN1_RCD_Msk & (_UINT32_(value) << CFG_CFGPCLKGEN1_RCD_Pos)) /* Assigment of value for RCD in the CFG_CFGPCLKGEN1 register */
#define   CFG_CFGPCLKGEN1_RCD_ON_Val          _UINT32_(0x1)                                        /* (CFG_CFGPCLKGEN1) Enable PGCLK  */
#define   CFG_CFGPCLKGEN1_RCD_OFF_Val         _UINT32_(0x0)                                        /* (CFG_CFGPCLKGEN1) Disable PGCLK  */
#define CFG_CFGPCLKGEN1_RCD_ON                (CFG_CFGPCLKGEN1_RCD_ON_Val << CFG_CFGPCLKGEN1_RCD_Pos) /* (CFG_CFGPCLKGEN1) Enable PGCLK Position  */
#define CFG_CFGPCLKGEN1_RCD_OFF               (CFG_CFGPCLKGEN1_RCD_OFF_Val << CFG_CFGPCLKGEN1_RCD_Pos) /* (CFG_CFGPCLKGEN1) Disable PGCLK Position  */
#define CFG_CFGPCLKGEN1_FREQMMCSEL_Pos        _UINT32_(8)                                          /* (CFG_CFGPCLKGEN1) FREQMMC Clock Selection Position */
#define CFG_CFGPCLKGEN1_FREQMMCSEL_Msk        (_UINT32_(0x7) << CFG_CFGPCLKGEN1_FREQMMCSEL_Pos)    /* (CFG_CFGPCLKGEN1) FREQMMC Clock Selection Mask */
#define CFG_CFGPCLKGEN1_FREQMMCSEL(value)     (CFG_CFGPCLKGEN1_FREQMMCSEL_Msk & (_UINT32_(value) << CFG_CFGPCLKGEN1_FREQMMCSEL_Pos)) /* Assigment of value for FREQMMCSEL in the CFG_CFGPCLKGEN1 register */
#define   CFG_CFGPCLKGEN1_FREQMMCSEL_NO_CLK_Val _UINT32_(0x0)                                        /* (CFG_CFGPCLKGEN1) No Clock  */
#define   CFG_CFGPCLKGEN1_FREQMMCSEL_REFO1_Val _UINT32_(0x1)                                        /* (CFG_CFGPCLKGEN1) Reference Clock 1  */
#define   CFG_CFGPCLKGEN1_FREQMMCSEL_REFO2_Val _UINT32_(0x2)                                        /* (CFG_CFGPCLKGEN1) Reference Clock 2  */
#define   CFG_CFGPCLKGEN1_FREQMMCSEL_REFO3_Val _UINT32_(0x3)                                        /* (CFG_CFGPCLKGEN1) Reference Clock 3  */
#define   CFG_CFGPCLKGEN1_FREQMMCSEL_REFO4_Val _UINT32_(0x4)                                        /* (CFG_CFGPCLKGEN1) Reference Clock 4  */
#define   CFG_CFGPCLKGEN1_FREQMMCSEL_REFO5_Val _UINT32_(0x5)                                        /* (CFG_CFGPCLKGEN1) Reference Clock 5  */
#define   CFG_CFGPCLKGEN1_FREQMMCSEL_REFO6_Val _UINT32_(0x6)                                        /* (CFG_CFGPCLKGEN1) Reference Clock 6  */
#define   CFG_CFGPCLKGEN1_FREQMMCSEL_LPCLK_Val _UINT32_(0x7)                                        /* (CFG_CFGPCLKGEN1) 32 KHz Low Power Clock  */
#define CFG_CFGPCLKGEN1_FREQMMCSEL_NO_CLK     (CFG_CFGPCLKGEN1_FREQMMCSEL_NO_CLK_Val << CFG_CFGPCLKGEN1_FREQMMCSEL_Pos) /* (CFG_CFGPCLKGEN1) No Clock Position  */
#define CFG_CFGPCLKGEN1_FREQMMCSEL_REFO1      (CFG_CFGPCLKGEN1_FREQMMCSEL_REFO1_Val << CFG_CFGPCLKGEN1_FREQMMCSEL_Pos) /* (CFG_CFGPCLKGEN1) Reference Clock 1 Position  */
#define CFG_CFGPCLKGEN1_FREQMMCSEL_REFO2      (CFG_CFGPCLKGEN1_FREQMMCSEL_REFO2_Val << CFG_CFGPCLKGEN1_FREQMMCSEL_Pos) /* (CFG_CFGPCLKGEN1) Reference Clock 2 Position  */
#define CFG_CFGPCLKGEN1_FREQMMCSEL_REFO3      (CFG_CFGPCLKGEN1_FREQMMCSEL_REFO3_Val << CFG_CFGPCLKGEN1_FREQMMCSEL_Pos) /* (CFG_CFGPCLKGEN1) Reference Clock 3 Position  */
#define CFG_CFGPCLKGEN1_FREQMMCSEL_REFO4      (CFG_CFGPCLKGEN1_FREQMMCSEL_REFO4_Val << CFG_CFGPCLKGEN1_FREQMMCSEL_Pos) /* (CFG_CFGPCLKGEN1) Reference Clock 4 Position  */
#define CFG_CFGPCLKGEN1_FREQMMCSEL_REFO5      (CFG_CFGPCLKGEN1_FREQMMCSEL_REFO5_Val << CFG_CFGPCLKGEN1_FREQMMCSEL_Pos) /* (CFG_CFGPCLKGEN1) Reference Clock 5 Position  */
#define CFG_CFGPCLKGEN1_FREQMMCSEL_REFO6      (CFG_CFGPCLKGEN1_FREQMMCSEL_REFO6_Val << CFG_CFGPCLKGEN1_FREQMMCSEL_Pos) /* (CFG_CFGPCLKGEN1) Reference Clock 6 Position  */
#define CFG_CFGPCLKGEN1_FREQMMCSEL_LPCLK      (CFG_CFGPCLKGEN1_FREQMMCSEL_LPCLK_Val << CFG_CFGPCLKGEN1_FREQMMCSEL_Pos) /* (CFG_CFGPCLKGEN1) 32 KHz Low Power Clock Position  */
#define CFG_CFGPCLKGEN1_MCD_Pos               _UINT32_(11)                                         /* (CFG_CFGPCLKGEN1) FREQMMC Clock Disable Position */
#define CFG_CFGPCLKGEN1_MCD_Msk               (_UINT32_(0x1) << CFG_CFGPCLKGEN1_MCD_Pos)           /* (CFG_CFGPCLKGEN1) FREQMMC Clock Disable Mask */
#define CFG_CFGPCLKGEN1_MCD(value)            (CFG_CFGPCLKGEN1_MCD_Msk & (_UINT32_(value) << CFG_CFGPCLKGEN1_MCD_Pos)) /* Assigment of value for MCD in the CFG_CFGPCLKGEN1 register */
#define   CFG_CFGPCLKGEN1_MCD_ON_Val          _UINT32_(0x1)                                        /* (CFG_CFGPCLKGEN1) Enable PGCLK  */
#define   CFG_CFGPCLKGEN1_MCD_OFF_Val         _UINT32_(0x0)                                        /* (CFG_CFGPCLKGEN1) Disable PGCLK  */
#define CFG_CFGPCLKGEN1_MCD_ON                (CFG_CFGPCLKGEN1_MCD_ON_Val << CFG_CFGPCLKGEN1_MCD_Pos) /* (CFG_CFGPCLKGEN1) Enable PGCLK Position  */
#define CFG_CFGPCLKGEN1_MCD_OFF               (CFG_CFGPCLKGEN1_MCD_OFF_Val << CFG_CFGPCLKGEN1_MCD_Pos) /* (CFG_CFGPCLKGEN1) Disable PGCLK Position  */
#define CFG_CFGPCLKGEN1_SERCOM01CSEL_Pos      _UINT32_(12)                                         /* (CFG_CFGPCLKGEN1) SERCOM0/1 Clock Selection Position */
#define CFG_CFGPCLKGEN1_SERCOM01CSEL_Msk      (_UINT32_(0x7) << CFG_CFGPCLKGEN1_SERCOM01CSEL_Pos)  /* (CFG_CFGPCLKGEN1) SERCOM0/1 Clock Selection Mask */
#define CFG_CFGPCLKGEN1_SERCOM01CSEL(value)   (CFG_CFGPCLKGEN1_SERCOM01CSEL_Msk & (_UINT32_(value) << CFG_CFGPCLKGEN1_SERCOM01CSEL_Pos)) /* Assigment of value for SERCOM01CSEL in the CFG_CFGPCLKGEN1 register */
#define   CFG_CFGPCLKGEN1_SERCOM01CSEL_NO_CLK_Val _UINT32_(0x0)                                        /* (CFG_CFGPCLKGEN1) No Clock  */
#define   CFG_CFGPCLKGEN1_SERCOM01CSEL_REFO1_Val _UINT32_(0x1)                                        /* (CFG_CFGPCLKGEN1) Reference Clock 1  */
#define   CFG_CFGPCLKGEN1_SERCOM01CSEL_REFO2_Val _UINT32_(0x2)                                        /* (CFG_CFGPCLKGEN1) Reference Clock 2  */
#define   CFG_CFGPCLKGEN1_SERCOM01CSEL_REFO3_Val _UINT32_(0x3)                                        /* (CFG_CFGPCLKGEN1) Reference Clock 3  */
#define   CFG_CFGPCLKGEN1_SERCOM01CSEL_REFO4_Val _UINT32_(0x4)                                        /* (CFG_CFGPCLKGEN1) Reference Clock 4  */
#define   CFG_CFGPCLKGEN1_SERCOM01CSEL_REFO5_Val _UINT32_(0x5)                                        /* (CFG_CFGPCLKGEN1) Reference Clock 5  */
#define   CFG_CFGPCLKGEN1_SERCOM01CSEL_REFO6_Val _UINT32_(0x6)                                        /* (CFG_CFGPCLKGEN1) Reference Clock 6  */
#define   CFG_CFGPCLKGEN1_SERCOM01CSEL_LPCLK_Val _UINT32_(0x7)                                        /* (CFG_CFGPCLKGEN1) 32 KHz Low Power Clock  */
#define CFG_CFGPCLKGEN1_SERCOM01CSEL_NO_CLK   (CFG_CFGPCLKGEN1_SERCOM01CSEL_NO_CLK_Val << CFG_CFGPCLKGEN1_SERCOM01CSEL_Pos) /* (CFG_CFGPCLKGEN1) No Clock Position  */
#define CFG_CFGPCLKGEN1_SERCOM01CSEL_REFO1    (CFG_CFGPCLKGEN1_SERCOM01CSEL_REFO1_Val << CFG_CFGPCLKGEN1_SERCOM01CSEL_Pos) /* (CFG_CFGPCLKGEN1) Reference Clock 1 Position  */
#define CFG_CFGPCLKGEN1_SERCOM01CSEL_REFO2    (CFG_CFGPCLKGEN1_SERCOM01CSEL_REFO2_Val << CFG_CFGPCLKGEN1_SERCOM01CSEL_Pos) /* (CFG_CFGPCLKGEN1) Reference Clock 2 Position  */
#define CFG_CFGPCLKGEN1_SERCOM01CSEL_REFO3    (CFG_CFGPCLKGEN1_SERCOM01CSEL_REFO3_Val << CFG_CFGPCLKGEN1_SERCOM01CSEL_Pos) /* (CFG_CFGPCLKGEN1) Reference Clock 3 Position  */
#define CFG_CFGPCLKGEN1_SERCOM01CSEL_REFO4    (CFG_CFGPCLKGEN1_SERCOM01CSEL_REFO4_Val << CFG_CFGPCLKGEN1_SERCOM01CSEL_Pos) /* (CFG_CFGPCLKGEN1) Reference Clock 4 Position  */
#define CFG_CFGPCLKGEN1_SERCOM01CSEL_REFO5    (CFG_CFGPCLKGEN1_SERCOM01CSEL_REFO5_Val << CFG_CFGPCLKGEN1_SERCOM01CSEL_Pos) /* (CFG_CFGPCLKGEN1) Reference Clock 5 Position  */
#define CFG_CFGPCLKGEN1_SERCOM01CSEL_REFO6    (CFG_CFGPCLKGEN1_SERCOM01CSEL_REFO6_Val << CFG_CFGPCLKGEN1_SERCOM01CSEL_Pos) /* (CFG_CFGPCLKGEN1) Reference Clock 6 Position  */
#define CFG_CFGPCLKGEN1_SERCOM01CSEL_LPCLK    (CFG_CFGPCLKGEN1_SERCOM01CSEL_LPCLK_Val << CFG_CFGPCLKGEN1_SERCOM01CSEL_Pos) /* (CFG_CFGPCLKGEN1) 32 KHz Low Power Clock Position  */
#define CFG_CFGPCLKGEN1_S01CD_Pos             _UINT32_(15)                                         /* (CFG_CFGPCLKGEN1) SERCOM0/1 Clock Disable Position */
#define CFG_CFGPCLKGEN1_S01CD_Msk             (_UINT32_(0x1) << CFG_CFGPCLKGEN1_S01CD_Pos)         /* (CFG_CFGPCLKGEN1) SERCOM0/1 Clock Disable Mask */
#define CFG_CFGPCLKGEN1_S01CD(value)          (CFG_CFGPCLKGEN1_S01CD_Msk & (_UINT32_(value) << CFG_CFGPCLKGEN1_S01CD_Pos)) /* Assigment of value for S01CD in the CFG_CFGPCLKGEN1 register */
#define   CFG_CFGPCLKGEN1_S01CD_ON_Val        _UINT32_(0x1)                                        /* (CFG_CFGPCLKGEN1) Enable PGCLK  */
#define   CFG_CFGPCLKGEN1_S01CD_OFF_Val       _UINT32_(0x0)                                        /* (CFG_CFGPCLKGEN1) Disable PGCLK  */
#define CFG_CFGPCLKGEN1_S01CD_ON              (CFG_CFGPCLKGEN1_S01CD_ON_Val << CFG_CFGPCLKGEN1_S01CD_Pos) /* (CFG_CFGPCLKGEN1) Enable PGCLK Position  */
#define CFG_CFGPCLKGEN1_S01CD_OFF             (CFG_CFGPCLKGEN1_S01CD_OFF_Val << CFG_CFGPCLKGEN1_S01CD_Pos) /* (CFG_CFGPCLKGEN1) Disable PGCLK Position  */
#define CFG_CFGPCLKGEN1_SERCOM23CSEL_Pos      _UINT32_(16)                                         /* (CFG_CFGPCLKGEN1) SERCOM2/3 Clock Selection Position */
#define CFG_CFGPCLKGEN1_SERCOM23CSEL_Msk      (_UINT32_(0x7) << CFG_CFGPCLKGEN1_SERCOM23CSEL_Pos)  /* (CFG_CFGPCLKGEN1) SERCOM2/3 Clock Selection Mask */
#define CFG_CFGPCLKGEN1_SERCOM23CSEL(value)   (CFG_CFGPCLKGEN1_SERCOM23CSEL_Msk & (_UINT32_(value) << CFG_CFGPCLKGEN1_SERCOM23CSEL_Pos)) /* Assigment of value for SERCOM23CSEL in the CFG_CFGPCLKGEN1 register */
#define   CFG_CFGPCLKGEN1_SERCOM23CSEL_NO_CLK_Val _UINT32_(0x0)                                        /* (CFG_CFGPCLKGEN1) No Clock  */
#define   CFG_CFGPCLKGEN1_SERCOM23CSEL_REFO1_Val _UINT32_(0x1)                                        /* (CFG_CFGPCLKGEN1) Reference Clock 1  */
#define   CFG_CFGPCLKGEN1_SERCOM23CSEL_REFO2_Val _UINT32_(0x2)                                        /* (CFG_CFGPCLKGEN1) Reference Clock 2  */
#define   CFG_CFGPCLKGEN1_SERCOM23CSEL_REFO3_Val _UINT32_(0x3)                                        /* (CFG_CFGPCLKGEN1) Reference Clock 3  */
#define   CFG_CFGPCLKGEN1_SERCOM23CSEL_REFO4_Val _UINT32_(0x4)                                        /* (CFG_CFGPCLKGEN1) Reference Clock 4  */
#define   CFG_CFGPCLKGEN1_SERCOM23CSEL_REFO5_Val _UINT32_(0x5)                                        /* (CFG_CFGPCLKGEN1) Reference Clock 5  */
#define   CFG_CFGPCLKGEN1_SERCOM23CSEL_REFO6_Val _UINT32_(0x6)                                        /* (CFG_CFGPCLKGEN1) Reference Clock 6  */
#define   CFG_CFGPCLKGEN1_SERCOM23CSEL_LPCLK_Val _UINT32_(0x7)                                        /* (CFG_CFGPCLKGEN1) 32 KHz Low Power Clock  */
#define CFG_CFGPCLKGEN1_SERCOM23CSEL_NO_CLK   (CFG_CFGPCLKGEN1_SERCOM23CSEL_NO_CLK_Val << CFG_CFGPCLKGEN1_SERCOM23CSEL_Pos) /* (CFG_CFGPCLKGEN1) No Clock Position  */
#define CFG_CFGPCLKGEN1_SERCOM23CSEL_REFO1    (CFG_CFGPCLKGEN1_SERCOM23CSEL_REFO1_Val << CFG_CFGPCLKGEN1_SERCOM23CSEL_Pos) /* (CFG_CFGPCLKGEN1) Reference Clock 1 Position  */
#define CFG_CFGPCLKGEN1_SERCOM23CSEL_REFO2    (CFG_CFGPCLKGEN1_SERCOM23CSEL_REFO2_Val << CFG_CFGPCLKGEN1_SERCOM23CSEL_Pos) /* (CFG_CFGPCLKGEN1) Reference Clock 2 Position  */
#define CFG_CFGPCLKGEN1_SERCOM23CSEL_REFO3    (CFG_CFGPCLKGEN1_SERCOM23CSEL_REFO3_Val << CFG_CFGPCLKGEN1_SERCOM23CSEL_Pos) /* (CFG_CFGPCLKGEN1) Reference Clock 3 Position  */
#define CFG_CFGPCLKGEN1_SERCOM23CSEL_REFO4    (CFG_CFGPCLKGEN1_SERCOM23CSEL_REFO4_Val << CFG_CFGPCLKGEN1_SERCOM23CSEL_Pos) /* (CFG_CFGPCLKGEN1) Reference Clock 4 Position  */
#define CFG_CFGPCLKGEN1_SERCOM23CSEL_REFO5    (CFG_CFGPCLKGEN1_SERCOM23CSEL_REFO5_Val << CFG_CFGPCLKGEN1_SERCOM23CSEL_Pos) /* (CFG_CFGPCLKGEN1) Reference Clock 5 Position  */
#define CFG_CFGPCLKGEN1_SERCOM23CSEL_REFO6    (CFG_CFGPCLKGEN1_SERCOM23CSEL_REFO6_Val << CFG_CFGPCLKGEN1_SERCOM23CSEL_Pos) /* (CFG_CFGPCLKGEN1) Reference Clock 6 Position  */
#define CFG_CFGPCLKGEN1_SERCOM23CSEL_LPCLK    (CFG_CFGPCLKGEN1_SERCOM23CSEL_LPCLK_Val << CFG_CFGPCLKGEN1_SERCOM23CSEL_Pos) /* (CFG_CFGPCLKGEN1) 32 KHz Low Power Clock Position  */
#define CFG_CFGPCLKGEN1_S23CD_Pos             _UINT32_(19)                                         /* (CFG_CFGPCLKGEN1) SERCOM2/3 Clock Disable Position */
#define CFG_CFGPCLKGEN1_S23CD_Msk             (_UINT32_(0x1) << CFG_CFGPCLKGEN1_S23CD_Pos)         /* (CFG_CFGPCLKGEN1) SERCOM2/3 Clock Disable Mask */
#define CFG_CFGPCLKGEN1_S23CD(value)          (CFG_CFGPCLKGEN1_S23CD_Msk & (_UINT32_(value) << CFG_CFGPCLKGEN1_S23CD_Pos)) /* Assigment of value for S23CD in the CFG_CFGPCLKGEN1 register */
#define   CFG_CFGPCLKGEN1_S23CD_ON_Val        _UINT32_(0x1)                                        /* (CFG_CFGPCLKGEN1) Enable PGCLK  */
#define   CFG_CFGPCLKGEN1_S23CD_OFF_Val       _UINT32_(0x0)                                        /* (CFG_CFGPCLKGEN1) Disable PGCLK  */
#define CFG_CFGPCLKGEN1_S23CD_ON              (CFG_CFGPCLKGEN1_S23CD_ON_Val << CFG_CFGPCLKGEN1_S23CD_Pos) /* (CFG_CFGPCLKGEN1) Enable PGCLK Position  */
#define CFG_CFGPCLKGEN1_S23CD_OFF             (CFG_CFGPCLKGEN1_S23CD_OFF_Val << CFG_CFGPCLKGEN1_S23CD_Pos) /* (CFG_CFGPCLKGEN1) Disable PGCLK Position  */
#define CFG_CFGPCLKGEN1_TCC12CSEL_Pos         _UINT32_(20)                                         /* (CFG_CFGPCLKGEN1) TCC1/2 Clock Selection Position */
#define CFG_CFGPCLKGEN1_TCC12CSEL_Msk         (_UINT32_(0x7) << CFG_CFGPCLKGEN1_TCC12CSEL_Pos)     /* (CFG_CFGPCLKGEN1) TCC1/2 Clock Selection Mask */
#define CFG_CFGPCLKGEN1_TCC12CSEL(value)      (CFG_CFGPCLKGEN1_TCC12CSEL_Msk & (_UINT32_(value) << CFG_CFGPCLKGEN1_TCC12CSEL_Pos)) /* Assigment of value for TCC12CSEL in the CFG_CFGPCLKGEN1 register */
#define   CFG_CFGPCLKGEN1_TCC12CSEL_NO_CLK_Val _UINT32_(0x0)                                        /* (CFG_CFGPCLKGEN1) No Clock  */
#define   CFG_CFGPCLKGEN1_TCC12CSEL_REFO1_Val _UINT32_(0x1)                                        /* (CFG_CFGPCLKGEN1) Reference Clock 1  */
#define   CFG_CFGPCLKGEN1_TCC12CSEL_REFO2_Val _UINT32_(0x2)                                        /* (CFG_CFGPCLKGEN1) Reference Clock 2  */
#define   CFG_CFGPCLKGEN1_TCC12CSEL_REFO3_Val _UINT32_(0x3)                                        /* (CFG_CFGPCLKGEN1) Reference Clock 3  */
#define   CFG_CFGPCLKGEN1_TCC12CSEL_REFO4_Val _UINT32_(0x4)                                        /* (CFG_CFGPCLKGEN1) Reference Clock 4  */
#define   CFG_CFGPCLKGEN1_TCC12CSEL_REFO5_Val _UINT32_(0x5)                                        /* (CFG_CFGPCLKGEN1) Reference Clock 5  */
#define   CFG_CFGPCLKGEN1_TCC12CSEL_REFO6_Val _UINT32_(0x6)                                        /* (CFG_CFGPCLKGEN1) Reference Clock 6  */
#define   CFG_CFGPCLKGEN1_TCC12CSEL_LPCLK_Val _UINT32_(0x7)                                        /* (CFG_CFGPCLKGEN1) 32 KHz Low Power Clock  */
#define CFG_CFGPCLKGEN1_TCC12CSEL_NO_CLK      (CFG_CFGPCLKGEN1_TCC12CSEL_NO_CLK_Val << CFG_CFGPCLKGEN1_TCC12CSEL_Pos) /* (CFG_CFGPCLKGEN1) No Clock Position  */
#define CFG_CFGPCLKGEN1_TCC12CSEL_REFO1       (CFG_CFGPCLKGEN1_TCC12CSEL_REFO1_Val << CFG_CFGPCLKGEN1_TCC12CSEL_Pos) /* (CFG_CFGPCLKGEN1) Reference Clock 1 Position  */
#define CFG_CFGPCLKGEN1_TCC12CSEL_REFO2       (CFG_CFGPCLKGEN1_TCC12CSEL_REFO2_Val << CFG_CFGPCLKGEN1_TCC12CSEL_Pos) /* (CFG_CFGPCLKGEN1) Reference Clock 2 Position  */
#define CFG_CFGPCLKGEN1_TCC12CSEL_REFO3       (CFG_CFGPCLKGEN1_TCC12CSEL_REFO3_Val << CFG_CFGPCLKGEN1_TCC12CSEL_Pos) /* (CFG_CFGPCLKGEN1) Reference Clock 3 Position  */
#define CFG_CFGPCLKGEN1_TCC12CSEL_REFO4       (CFG_CFGPCLKGEN1_TCC12CSEL_REFO4_Val << CFG_CFGPCLKGEN1_TCC12CSEL_Pos) /* (CFG_CFGPCLKGEN1) Reference Clock 4 Position  */
