Microchip-MPLAB-Harmony/wireless_apps_pic32cxbz2_wbz45/apps/ieee_802_15_4/MAC/push_pull_mac_app/demoapp_ffd/firmware/src/packs/PIC32CX1012BZ25048_DFP/component/cfg.h
#define CFG_CFGPCLKGEN3_TCC0CSEL_REFO1        (CFG_CFGPCLKGEN3_TCC0CSEL_REFO1_Val << CFG_CFGPCLKGEN3_TCC0CSEL_Pos) /* (CFG_CFGPCLKGEN3) Reference Clock 1 Position  */
#define CFG_CFGPCLKGEN3_TCC0CSEL_REFO2        (CFG_CFGPCLKGEN3_TCC0CSEL_REFO2_Val << CFG_CFGPCLKGEN3_TCC0CSEL_Pos) /* (CFG_CFGPCLKGEN3) Reference Clock 2 Position  */
#define CFG_CFGPCLKGEN3_TCC0CSEL_REFO3        (CFG_CFGPCLKGEN3_TCC0CSEL_REFO3_Val << CFG_CFGPCLKGEN3_TCC0CSEL_Pos) /* (CFG_CFGPCLKGEN3) Reference Clock 3 Position  */
#define CFG_CFGPCLKGEN3_TCC0CSEL_REFO4        (CFG_CFGPCLKGEN3_TCC0CSEL_REFO4_Val << CFG_CFGPCLKGEN3_TCC0CSEL_Pos) /* (CFG_CFGPCLKGEN3) Reference Clock 4 Position  */
#define CFG_CFGPCLKGEN3_TCC0CSEL_REFO5        (CFG_CFGPCLKGEN3_TCC0CSEL_REFO5_Val << CFG_CFGPCLKGEN3_TCC0CSEL_Pos) /* (CFG_CFGPCLKGEN3) Reference Clock 5 Position  */
#define CFG_CFGPCLKGEN3_TCC0CSEL_REFO6        (CFG_CFGPCLKGEN3_TCC0CSEL_REFO6_Val << CFG_CFGPCLKGEN3_TCC0CSEL_Pos) /* (CFG_CFGPCLKGEN3) Reference Clock 6 Position  */
#define CFG_CFGPCLKGEN3_TCC0CSEL_LPCLK        (CFG_CFGPCLKGEN3_TCC0CSEL_LPCLK_Val << CFG_CFGPCLKGEN3_TCC0CSEL_Pos) /* (CFG_CFGPCLKGEN3) 32 KHz Low Power Clock Position  */
#define CFG_CFGPCLKGEN3_TCC0CD_Pos            _UINT32_(23)                                         /* (CFG_CFGPCLKGEN3) TCC0 Clock Disable Position */
#define CFG_CFGPCLKGEN3_TCC0CD_Msk            (_UINT32_(0x1) << CFG_CFGPCLKGEN3_TCC0CD_Pos)        /* (CFG_CFGPCLKGEN3) TCC0 Clock Disable Mask */
#define CFG_CFGPCLKGEN3_TCC0CD(value)         (CFG_CFGPCLKGEN3_TCC0CD_Msk & (_UINT32_(value) << CFG_CFGPCLKGEN3_TCC0CD_Pos)) /* Assigment of value for TCC0CD in the CFG_CFGPCLKGEN3 register */
#define   CFG_CFGPCLKGEN3_TCC0CD_ON_Val       _UINT32_(0x1)                                        /* (CFG_CFGPCLKGEN3) Enable PGCLK  */
#define   CFG_CFGPCLKGEN3_TCC0CD_OFF_Val      _UINT32_(0x0)                                        /* (CFG_CFGPCLKGEN3) Disable PGCLK  */
#define CFG_CFGPCLKGEN3_TCC0CD_ON             (CFG_CFGPCLKGEN3_TCC0CD_ON_Val << CFG_CFGPCLKGEN3_TCC0CD_Pos) /* (CFG_CFGPCLKGEN3) Enable PGCLK Position  */
#define CFG_CFGPCLKGEN3_TCC0CD_OFF            (CFG_CFGPCLKGEN3_TCC0CD_OFF_Val << CFG_CFGPCLKGEN3_TCC0CD_Pos) /* (CFG_CFGPCLKGEN3) Disable PGCLK Position  */
#define CFG_CFGPCLKGEN3_TC0CSEL_Pos           _UINT32_(24)                                         /* (CFG_CFGPCLKGEN3) TC0 Peripheral Clock Selection Position */
#define CFG_CFGPCLKGEN3_TC0CSEL_Msk           (_UINT32_(0x7) << CFG_CFGPCLKGEN3_TC0CSEL_Pos)       /* (CFG_CFGPCLKGEN3) TC0 Peripheral Clock Selection Mask */
#define CFG_CFGPCLKGEN3_TC0CSEL(value)        (CFG_CFGPCLKGEN3_TC0CSEL_Msk & (_UINT32_(value) << CFG_CFGPCLKGEN3_TC0CSEL_Pos)) /* Assigment of value for TC0CSEL in the CFG_CFGPCLKGEN3 register */
#define   CFG_CFGPCLKGEN3_TC0CSEL_NO_CLK_Val  _UINT32_(0x0)                                        /* (CFG_CFGPCLKGEN3) No Clock  */
#define   CFG_CFGPCLKGEN3_TC0CSEL_REFO1_Val   _UINT32_(0x1)                                        /* (CFG_CFGPCLKGEN3) Reference Clock 1  */
#define   CFG_CFGPCLKGEN3_TC0CSEL_REFO2_Val   _UINT32_(0x2)                                        /* (CFG_CFGPCLKGEN3) Reference Clock 2  */
#define   CFG_CFGPCLKGEN3_TC0CSEL_REFO3_Val   _UINT32_(0x3)                                        /* (CFG_CFGPCLKGEN3) Reference Clock 3  */
#define   CFG_CFGPCLKGEN3_TC0CSEL_REFO4_Val   _UINT32_(0x4)                                        /* (CFG_CFGPCLKGEN3) Reference Clock 4  */
#define   CFG_CFGPCLKGEN3_TC0CSEL_REFO5_Val   _UINT32_(0x5)                                        /* (CFG_CFGPCLKGEN3) Reference Clock 5  */
#define   CFG_CFGPCLKGEN3_TC0CSEL_REFO6_Val   _UINT32_(0x6)                                        /* (CFG_CFGPCLKGEN3) Reference Clock 6  */
#define   CFG_CFGPCLKGEN3_TC0CSEL_LPCLK_Val   _UINT32_(0x7)                                        /* (CFG_CFGPCLKGEN3) 32 KHz Low Power Clock  */
#define CFG_CFGPCLKGEN3_TC0CSEL_NO_CLK        (CFG_CFGPCLKGEN3_TC0CSEL_NO_CLK_Val << CFG_CFGPCLKGEN3_TC0CSEL_Pos) /* (CFG_CFGPCLKGEN3) No Clock Position  */
#define CFG_CFGPCLKGEN3_TC0CSEL_REFO1         (CFG_CFGPCLKGEN3_TC0CSEL_REFO1_Val << CFG_CFGPCLKGEN3_TC0CSEL_Pos) /* (CFG_CFGPCLKGEN3) Reference Clock 1 Position  */
#define CFG_CFGPCLKGEN3_TC0CSEL_REFO2         (CFG_CFGPCLKGEN3_TC0CSEL_REFO2_Val << CFG_CFGPCLKGEN3_TC0CSEL_Pos) /* (CFG_CFGPCLKGEN3) Reference Clock 2 Position  */
#define CFG_CFGPCLKGEN3_TC0CSEL_REFO3         (CFG_CFGPCLKGEN3_TC0CSEL_REFO3_Val << CFG_CFGPCLKGEN3_TC0CSEL_Pos) /* (CFG_CFGPCLKGEN3) Reference Clock 3 Position  */
#define CFG_CFGPCLKGEN3_TC0CSEL_REFO4         (CFG_CFGPCLKGEN3_TC0CSEL_REFO4_Val << CFG_CFGPCLKGEN3_TC0CSEL_Pos) /* (CFG_CFGPCLKGEN3) Reference Clock 4 Position  */
#define CFG_CFGPCLKGEN3_TC0CSEL_REFO5         (CFG_CFGPCLKGEN3_TC0CSEL_REFO5_Val << CFG_CFGPCLKGEN3_TC0CSEL_Pos) /* (CFG_CFGPCLKGEN3) Reference Clock 5 Position  */
#define CFG_CFGPCLKGEN3_TC0CSEL_REFO6         (CFG_CFGPCLKGEN3_TC0CSEL_REFO6_Val << CFG_CFGPCLKGEN3_TC0CSEL_Pos) /* (CFG_CFGPCLKGEN3) Reference Clock 6 Position  */
#define CFG_CFGPCLKGEN3_TC0CSEL_LPCLK         (CFG_CFGPCLKGEN3_TC0CSEL_LPCLK_Val << CFG_CFGPCLKGEN3_TC0CSEL_Pos) /* (CFG_CFGPCLKGEN3) 32 KHz Low Power Clock Position  */
#define CFG_CFGPCLKGEN3_TC0CD_Pos             _UINT32_(27)                                         /* (CFG_CFGPCLKGEN3) TC0 Clock Disable Position */
#define CFG_CFGPCLKGEN3_TC0CD_Msk             (_UINT32_(0x1) << CFG_CFGPCLKGEN3_TC0CD_Pos)         /* (CFG_CFGPCLKGEN3) TC0 Clock Disable Mask */
#define CFG_CFGPCLKGEN3_TC0CD(value)          (CFG_CFGPCLKGEN3_TC0CD_Msk & (_UINT32_(value) << CFG_CFGPCLKGEN3_TC0CD_Pos)) /* Assigment of value for TC0CD in the CFG_CFGPCLKGEN3 register */
#define   CFG_CFGPCLKGEN3_TC0CD_ON_Val        _UINT32_(0x1)                                        /* (CFG_CFGPCLKGEN3) Enable PGCLK  */
#define   CFG_CFGPCLKGEN3_TC0CD_OFF_Val       _UINT32_(0x0)                                        /* (CFG_CFGPCLKGEN3) Disable PGCLK  */
#define CFG_CFGPCLKGEN3_TC0CD_ON              (CFG_CFGPCLKGEN3_TC0CD_ON_Val << CFG_CFGPCLKGEN3_TC0CD_Pos) /* (CFG_CFGPCLKGEN3) Enable PGCLK Position  */
#define CFG_CFGPCLKGEN3_TC0CD_OFF             (CFG_CFGPCLKGEN3_TC0CD_OFF_Val << CFG_CFGPCLKGEN3_TC0CD_Pos) /* (CFG_CFGPCLKGEN3) Disable PGCLK Position  */
#define CFG_CFGPCLKGEN3_TC1CSEL_Pos           _UINT32_(28)                                         /* (CFG_CFGPCLKGEN3) TC1 Peripheral Clock Selection Position */
#define CFG_CFGPCLKGEN3_TC1CSEL_Msk           (_UINT32_(0x7) << CFG_CFGPCLKGEN3_TC1CSEL_Pos)       /* (CFG_CFGPCLKGEN3) TC1 Peripheral Clock Selection Mask */
#define CFG_CFGPCLKGEN3_TC1CSEL(value)        (CFG_CFGPCLKGEN3_TC1CSEL_Msk & (_UINT32_(value) << CFG_CFGPCLKGEN3_TC1CSEL_Pos)) /* Assigment of value for TC1CSEL in the CFG_CFGPCLKGEN3 register */
#define   CFG_CFGPCLKGEN3_TC1CSEL_NO_CLK_Val  _UINT32_(0x0)                                        /* (CFG_CFGPCLKGEN3) No Clock  */
#define   CFG_CFGPCLKGEN3_TC1CSEL_REFO1_Val   _UINT32_(0x1)                                        /* (CFG_CFGPCLKGEN3) Reference Clock 1  */
#define   CFG_CFGPCLKGEN3_TC1CSEL_REFO2_Val   _UINT32_(0x2)                                        /* (CFG_CFGPCLKGEN3) Reference Clock 2  */
#define   CFG_CFGPCLKGEN3_TC1CSEL_REFO3_Val   _UINT32_(0x3)                                        /* (CFG_CFGPCLKGEN3) Reference Clock 3  */
#define   CFG_CFGPCLKGEN3_TC1CSEL_REFO4_Val   _UINT32_(0x4)                                        /* (CFG_CFGPCLKGEN3) Reference Clock 4  */
#define   CFG_CFGPCLKGEN3_TC1CSEL_REFO5_Val   _UINT32_(0x5)                                        /* (CFG_CFGPCLKGEN3) Reference Clock 5  */
#define   CFG_CFGPCLKGEN3_TC1CSEL_REFO6_Val   _UINT32_(0x6)                                        /* (CFG_CFGPCLKGEN3) Reference Clock 6  */
#define   CFG_CFGPCLKGEN3_TC1CSEL_LPCLK_Val   _UINT32_(0x7)                                        /* (CFG_CFGPCLKGEN3) 32 KHz Low Power Clock  */
#define CFG_CFGPCLKGEN3_TC1CSEL_NO_CLK        (CFG_CFGPCLKGEN3_TC1CSEL_NO_CLK_Val << CFG_CFGPCLKGEN3_TC1CSEL_Pos) /* (CFG_CFGPCLKGEN3) No Clock Position  */
#define CFG_CFGPCLKGEN3_TC1CSEL_REFO1         (CFG_CFGPCLKGEN3_TC1CSEL_REFO1_Val << CFG_CFGPCLKGEN3_TC1CSEL_Pos) /* (CFG_CFGPCLKGEN3) Reference Clock 1 Position  */
#define CFG_CFGPCLKGEN3_TC1CSEL_REFO2         (CFG_CFGPCLKGEN3_TC1CSEL_REFO2_Val << CFG_CFGPCLKGEN3_TC1CSEL_Pos) /* (CFG_CFGPCLKGEN3) Reference Clock 2 Position  */
#define CFG_CFGPCLKGEN3_TC1CSEL_REFO3         (CFG_CFGPCLKGEN3_TC1CSEL_REFO3_Val << CFG_CFGPCLKGEN3_TC1CSEL_Pos) /* (CFG_CFGPCLKGEN3) Reference Clock 3 Position  */
#define CFG_CFGPCLKGEN3_TC1CSEL_REFO4         (CFG_CFGPCLKGEN3_TC1CSEL_REFO4_Val << CFG_CFGPCLKGEN3_TC1CSEL_Pos) /* (CFG_CFGPCLKGEN3) Reference Clock 4 Position  */
#define CFG_CFGPCLKGEN3_TC1CSEL_REFO5         (CFG_CFGPCLKGEN3_TC1CSEL_REFO5_Val << CFG_CFGPCLKGEN3_TC1CSEL_Pos) /* (CFG_CFGPCLKGEN3) Reference Clock 5 Position  */
#define CFG_CFGPCLKGEN3_TC1CSEL_REFO6         (CFG_CFGPCLKGEN3_TC1CSEL_REFO6_Val << CFG_CFGPCLKGEN3_TC1CSEL_Pos) /* (CFG_CFGPCLKGEN3) Reference Clock 6 Position  */
#define CFG_CFGPCLKGEN3_TC1CSEL_LPCLK         (CFG_CFGPCLKGEN3_TC1CSEL_LPCLK_Val << CFG_CFGPCLKGEN3_TC1CSEL_Pos) /* (CFG_CFGPCLKGEN3) 32 KHz Low Power Clock Position  */
#define CFG_CFGPCLKGEN3_TC1CD_Pos             _UINT32_(31)                                         /* (CFG_CFGPCLKGEN3) TC1 Clock Disable Position */
#define CFG_CFGPCLKGEN3_TC1CD_Msk             (_UINT32_(0x1) << CFG_CFGPCLKGEN3_TC1CD_Pos)         /* (CFG_CFGPCLKGEN3) TC1 Clock Disable Mask */
#define CFG_CFGPCLKGEN3_TC1CD(value)          (CFG_CFGPCLKGEN3_TC1CD_Msk & (_UINT32_(value) << CFG_CFGPCLKGEN3_TC1CD_Pos)) /* Assigment of value for TC1CD in the CFG_CFGPCLKGEN3 register */
#define   CFG_CFGPCLKGEN3_TC1CD_ON_Val        _UINT32_(0x1)                                        /* (CFG_CFGPCLKGEN3) Enable PGCLK  */
#define   CFG_CFGPCLKGEN3_TC1CD_OFF_Val       _UINT32_(0x0)                                        /* (CFG_CFGPCLKGEN3) Disable PGCLK  */
#define CFG_CFGPCLKGEN3_TC1CD_ON              (CFG_CFGPCLKGEN3_TC1CD_ON_Val << CFG_CFGPCLKGEN3_TC1CD_Pos) /* (CFG_CFGPCLKGEN3) Enable PGCLK Position  */
#define CFG_CFGPCLKGEN3_TC1CD_OFF             (CFG_CFGPCLKGEN3_TC1CD_OFF_Val << CFG_CFGPCLKGEN3_TC1CD_Pos) /* (CFG_CFGPCLKGEN3) Disable PGCLK Position  */
#define CFG_CFGPCLKGEN3_Msk                   _UINT32_(0xFFFFFFFF)                                 /* (CFG_CFGPCLKGEN3) Register Mask  */


/* -------- CFG_CFGPCLKGEN3CLR : (CFG Offset: 0x84) (R/W 32) Bit clear register -------- */
#define CFG_CFGPCLKGEN3CLR_RESETVALUE         _UINT32_(0x00)                                       /*  (CFG_CFGPCLKGEN3CLR) Bit clear register  Reset Value */

#define CFG_CFGPCLKGEN3CLR_Msk                _UINT32_(0x00000000)                                 /* (CFG_CFGPCLKGEN3CLR) Register Mask  */


/* -------- CFG_CFGPCLKGEN3SET : (CFG Offset: 0x88) (R/W 32) Bit set register -------- */
#define CFG_CFGPCLKGEN3SET_RESETVALUE         _UINT32_(0x00)                                       /*  (CFG_CFGPCLKGEN3SET) Bit set register  Reset Value */

#define CFG_CFGPCLKGEN3SET_Msk                _UINT32_(0x00000000)                                 /* (CFG_CFGPCLKGEN3SET) Register Mask  */


