Microchip-MPLAB-Harmony/wireless_apps_pic32cxbz2_wbz45/apps/ieee_802_15_4/MAC/push_pull_mac_app/demoapp_ffd/firmware/src/packs/PIC32CX1012BZ25048_DFP/component/cfg.h
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
/** \brief CFG register API structure */
typedef struct
{  /*  */
  __IO  uint32_t                       CFG_CFGCON0;        /**< Offset: 0x00 (R/W  32)  */
  __IO  uint32_t                       CFG_CFGCON0CLR;     /**< Offset: 0x04 (R/W  32) Bit clear register */
  __IO  uint32_t                       CFG_CFGCON0SET;     /**< Offset: 0x08 (R/W  32) Bit set register */
  __IO  uint32_t                       CFG_CFGCON0INV;     /**< Offset: 0x0C (R/W  32) Bit invert register */
  __IO  uint32_t                       CFG_CFGCON1;        /**< Offset: 0x10 (R/W  32)  */
  __IO  uint32_t                       CFG_CFGCON1CLR;     /**< Offset: 0x14 (R/W  32) Bit clear register */
  __IO  uint32_t                       CFG_CFGCON1SET;     /**< Offset: 0x18 (R/W  32) Bit set register */
  __IO  uint32_t                       CFG_CFGCON1INV;     /**< Offset: 0x1C (R/W  32) Bit invert register */
  __IO  uint32_t                       CFG_CFGCON2;        /**< Offset: 0x20 (R/W  32)  */
  __IO  uint32_t                       CFG_CFGCON2CLR;     /**< Offset: 0x24 (R/W  32) Bit clear register */
  __IO  uint32_t                       CFG_CFGCON2SET;     /**< Offset: 0x28 (R/W  32) Bit set register */
  __IO  uint32_t                       CFG_CFGCON2INV;     /**< Offset: 0x2C (R/W  32) Bit invert register */
  __I   uint8_t                        Reserved1[0x10];
  __IO  uint32_t                       CFG_CFGCON4;        /**< Offset: 0x40 (R/W  32)  */
  __IO  uint32_t                       CFG_CFGCON4CLR;     /**< Offset: 0x44 (R/W  32) Bit clear register */
  __IO  uint32_t                       CFG_CFGCON4SET;     /**< Offset: 0x48 (R/W  32) Bit set register */
  __IO  uint32_t                       CFG_CFGCON4INV;     /**< Offset: 0x4C (R/W  32) Bit invert register */
  __IO  uint32_t                       CFG_CFGPGQOS;       /**< Offset: 0x50 (R/W  32)  */
  __IO  uint32_t                       CFG_CFGPGQOSCLR;    /**< Offset: 0x54 (R/W  32) Bit clear register */
  __IO  uint32_t                       CFG_CFGPGQOSSET;    /**< Offset: 0x58 (R/W  32) Bit set register */
  __IO  uint32_t                       CFG_CFGPGQOSINV;    /**< Offset: 0x5C (R/W  32) Bit invert register */
  __IO  uint32_t                       CFG_CFGPCLKGEN1;    /**< Offset: 0x60 (R/W  32)  */
  __IO  uint32_t                       CFG_CFGPCLKGEN1CLR; /**< Offset: 0x64 (R/W  32) Bit clear register */
  __IO  uint32_t                       CFG_CFGPCLKGEN1SET; /**< Offset: 0x68 (R/W  32) Bit set register */
  __IO  uint32_t                       CFG_CFGPCLKGEN1INV; /**< Offset: 0x6C (R/W  32) Bit invert register */
  __IO  uint32_t                       CFG_CFGPCLKGEN2;    /**< Offset: 0x70 (R/W  32)  */
  __IO  uint32_t                       CFG_CFGPCLKGEN2CLR; /**< Offset: 0x74 (R/W  32) Bit clear register */
  __IO  uint32_t                       CFG_CFGPCLKGEN2SET; /**< Offset: 0x78 (R/W  32) Bit set register */
  __IO  uint32_t                       CFG_CFGPCLKGEN2INV; /**< Offset: 0x7C (R/W  32) Bit invert register */
  __IO  uint32_t                       CFG_CFGPCLKGEN3;    /**< Offset: 0x80 (R/W  32)  */
  __IO  uint32_t                       CFG_CFGPCLKGEN3CLR; /**< Offset: 0x84 (R/W  32) Bit clear register */
  __IO  uint32_t                       CFG_CFGPCLKGEN3SET; /**< Offset: 0x88 (R/W  32) Bit set register */
  __IO  uint32_t                       CFG_CFGPCLKGEN3INV; /**< Offset: 0x8C (R/W  32) Bit invert register */
  __I   uint32_t                       CFG_ID;             /**< Offset: 0x90 (R/   32) Device ID */
  __I   uint8_t                        Reserved2[0x0C];
  __IO  uint32_t                       CFG_USER_ID;        /**< Offset: 0xA0 (R/W  32)  */
  __IO  uint32_t                       CFG_USER_IDCLR;     /**< Offset: 0xA4 (R/W  32) Bit clear register */
  __IO  uint32_t                       CFG_USER_IDSET;     /**< Offset: 0xA8 (R/W  32) Bit set register */
  __IO  uint32_t                       CFG_USER_IDINV;     /**< Offset: 0xAC (R/W  32) Bit invert register */
  __IO  uint32_t                       CFG_SYSKEY;         /**< Offset: 0xB0 (R/W  32)  */
  __I   uint8_t                        Reserved3[0x0C];
  __IO  uint32_t                       CFG_PMD1;           /**< Offset: 0xC0 (R/W  32)  */
  __IO  uint32_t                       CFG_PMD1CLR;        /**< Offset: 0xC4 (R/W  32) Bit clear register */
  __IO  uint32_t                       CFG_PMD1SET;        /**< Offset: 0xC8 (R/W  32) Bit set register */
  __IO  uint32_t                       CFG_PMD1INV;        /**< Offset: 0xCC (R/W  32) Bit invert register */
  __IO  uint32_t                       CFG_PMD2;           /**< Offset: 0xD0 (R/W  32)  */
  __IO  uint32_t                       CFG_PMD2CLR;        /**< Offset: 0xD4 (R/W  32) Bit clear register */
  __IO  uint32_t                       CFG_PMD2SET;        /**< Offset: 0xD8 (R/W  32) Bit set register */
  __IO  uint32_t                       CFG_PMD2INV;        /**< Offset: 0xDC (R/W  32) Bit invert register */
  __IO  uint32_t                       CFG_PMD3;           /**< Offset: 0xE0 (R/W  32)  */
  __IO  uint32_t                       CFG_PMD3CLR;        /**< Offset: 0xE4 (R/W  32) Bit clear register */
  __IO  uint32_t                       CFG_PMD3SET;        /**< Offset: 0xE8 (R/W  32) Bit set register */
  __IO  uint32_t                       CFG_PMD3INV;        /**< Offset: 0xEC (R/W  32) Bit invert register */
  __I   uint8_t                        Reserved4[0x10];
  __IO  uint32_t                       CFG_MISCSTAT;       /**< Offset: 0x100 (R/W  32)  */
  __I   uint8_t                        Reserved5[0xFC];
  __I   uint32_t                       CFG_BCFG0;          /**< Offset: 0x200 (R/   32)  */
} cfg_registers_t;


#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */
#endif /* _BZ25_CFG_COMPONENT_H_ */
